Configuration/Documents/ПриходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходныйКассовыйОрдер</Name>
			<BasedOn>
				<xr:Item>Document.Реализация</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Управляет логикой формы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступленияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>На форме — гиперссылка</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Comment>ОграничениеТипа меняется в коде по виду операции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Comment>Отбор по Владельцу; скрывать по условию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Вводится вручную (нет ТЧ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Автозаполнение текущим пользователем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Configuration/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Configuration/Enums/ВидыОперацийПоступленияДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступленияДенег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Documents/ПриходныйКассовыйОрдер/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
        Ответственный = Пользователи.ТекущийПользователь();
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Реализация") Тогда
		ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПоставщика;
	Иначе
		Возврат;
	КонецЕсли;

	Организация       = ДанныеЗаполнения.Организация;
	Плательщик        = ДанныеЗаполнения.Контрагент;
	Договор           = ДанныеЗаполнения.Договор;
	СуммаДокумента    = ДанныеЗаполнения.СуммаДокумента;
	ДокументОснование = ДанныеЗаполнения;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.ДенежныеСредства.Записывать = Истина;
    Движения.Хозрасчетный.Записывать     = Истина;

    Движение             = Движения.ДенежныеСредства.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период      = Дата;
    Движение.Организация = Организация;
    Движение.Касса       = Касса;
    Движение.Сумма       = СуммаДокумента;

    АналитикаПроводки = ПолучитьАналитикуПроводки();
    ДвижениеБух            = Движения.Хозрасчетный.Добавить();
    ДвижениеБух.Период     = Дата;
    ДвижениеБух.СчетДт     = АналитикаПроводки.СчетДебета;
    ДвижениеБух.СчетКт     = АналитикаПроводки.СчетКредита;
    ДвижениеБух.Сумма      = СуммаДокумента;
    ДвижениеБух.Содержание = АналитикаПроводки.СодержаниеОперации;
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(
        ДвижениеБух.СчетДт, ДвижениеБух.СубконтоДт, АналитикаПроводки.СубконтоДебет);
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(
        ДвижениеБух.СчетКт, ДвижениеБух.СубконтоКт, АналитикаПроводки.СубконтоКредит);

КонецПроцедуры

Функция ПолучитьАналитикуПроводки()
    АналитикаПроводки = Новый Структура;
    АналитикаПроводки.Вставить("СчетДебета",    ПланыСчетов.Хозрасчетный.Касса);
    АналитикаПроводки.Вставить("СубконтоДебет", Касса);
    Если ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя Тогда
        АналитикаПроводки.Вставить("СчетКредита",        ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);
        АналитикаПроводки.Вставить("СубконтоКредит",     Плательщик);
        АналитикаПроводки.Вставить("СодержаниеОперации", "Оплата от покупателя наличными в кассу");
    ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПоставщика Тогда
        АналитикаПроводки.Вставить("СчетКредита",        ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками);
        АналитикаПроводки.Вставить("СубконтоКредит",     Плательщик);
        АналитикаПроводки.Вставить("СодержаниеОперации", "Возврат от поставщика наличными в кассу");
    ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника Тогда
        АналитикаПроводки.Вставить("СчетКредита",        ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами);
        АналитикаПроводки.Вставить("СубконтоКредит",     Плательщик);
        АналитикаПроводки.Вставить("СодержаниеОперации", "Возврат подотчётных средств наличными в кассу");
    КонецЕсли;
    Возврат АналитикаПроводки;
КонецФункции
